Repository: CofficLab/Lumi
Catalog: Packages/PluginPrototypeDesigner/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Ask the Agent to create a prototype.
zh_hans: 让 Agent 创建一个原型项目。
zh_hk: 讓 Agent 建立一個原型專案。

source: Ask the Agent to link a control to another screen, e.g. "make the primary button go to the detail screen".
zh_hans: 让 Agent 把某个控件连到另一屏，例如「让主按钮跳到详情页」。
zh_hk: 讓 Agent 把某個控件連到另一個畫面，例如「讓主按鈕跳到詳情頁」。

source: Block
zh_hans: 区块
zh_hk: 區塊

source: Captured HTML is truncated; read the current screen HTML before editing.
zh_hans: 捕获的 HTML 已截断；编辑前请读取当前屏幕的 HTML。
zh_hk: 擷取的 HTML 已截斷；編輯前請讀取目前畫面的 HTML。

source: Changing the device canvas re-renders existing screens at the new size; check the preview afterwards.
zh_hans: 更换设备画板会以新尺寸重新渲染已有屏幕，之后请检查预览。
zh_hk: 更換裝置畫板會以新尺寸重新算繪已有畫面，之後請檢查預覽。

source: Chat with the Agent to sketch product prototypes as connected HTML screens.
zh_hans: 和 Agent 聊天，用互相连接的 HTML 屏幕勾勒产品原型。
zh_hk: 和 Agent 聊天，用互相連結的 HTML 畫面勾勒產品原型。

source: Click Export and choose a folder.
zh_hans: 点击「导出」并选择一个文件夹。
zh_hk: 點擊「匯出」並選擇一個資料夾。

source: Click Refresh in the toolbar if the list or preview looks out of date.
zh_hans: 如果列表或预览看起来不是最新的，点击工具栏的刷新。
zh_hk: 如果清單或預覽看起來不是最新的，點擊工具列的重新載入。

source: Connected Screens
zh_hans: 互相连接的屏幕
zh_hk: 互相連結的畫面

source: Connecting Screens
zh_hans: 连接屏幕
zh_hk: 連接畫面

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Creating a Prototype
zh_hans: 创建原型
zh_hk: 建立原型

source: Current Element HTML
zh_hans: 当前元素 HTML
zh_hk: 目前元素 HTML

source: Delete Prototype
zh_hans: 删除原型
zh_hk: 刪除原型

source: Delete Screen
zh_hans: 删除屏幕
zh_hk: 刪除畫面

source: Describe a Screen
zh_hans: 用语言描述屏幕
zh_hk: 用語言描述畫面

source: Describe the screen in words and the Agent writes the layout for you.
zh_hans: 用几句话描述这一屏，Agent 会替你写出布局。
zh_hk: 用幾句話描述這個畫面，Agent 會替你寫出佈局。

source: Describe your product and the screens you need in the chat.
zh_hans: 在聊天里描述你的产品和你需要的屏幕。
zh_hk: 在聊天裡描述你的產品和你需要的畫面。

source: Describe your product and the screens you need, e.g. "a three-screen checkout flow for a coffee app".
zh_hans: 描述你的产品与需要的屏幕，例如「一个咖啡 App 的三屏结账流程」。
zh_hk: 描述你的產品與需要的畫面，例如「一個咖啡 App 的三個畫面結帳流程」。

source: Device
zh_hans: 设备
zh_hk: 裝置

source: Each screen is a standalone HTML document; imported images live in a shared assets folder.
zh_hans: 每一屏都是独立的 HTML 文档；导入的图片放在共享的 assets 目录。
zh_hk: 每個畫面都是獨立的 HTML 文件；匯入的圖片放在共享的 assets 目錄。

source: Editing a Screen
zh_hans: 编辑屏幕
zh_hk: 編輯畫面

source: Element
zh_hans: 元素
zh_hk: 元素

source: Every screen is rendered as a PNG at the device's exact pixel size.
zh_hans: 每一屏都按设备的精确像素尺寸渲染为 PNG。
zh_hk: 每個畫面都按裝置的精確像素尺寸算繪為 PNG。

source: Every screen renders on a real device canvas with exact pixel export.
zh_hans: 每一屏都在真实设备画板上渲染，并按精确像素导出。
zh_hk: 每個畫面都在真實裝置畫板上算繪，並按精確像素匯出。

source: Exact Device Canvas
zh_hans: 精确的设备画板
zh_hk: 精確的裝置畫板

source: Exact Device Export
zh_hans: 按设备精确导出
zh_hk: 按裝置精確匯出

source: Export
zh_hans: 导出
zh_hk: 匯出

source: Export Failed
zh_hans: 导出失败
zh_hk: 匯出失敗

source: Export when the flow reads correctly.
zh_hans: 流程读起来通顺后就导出。
zh_hk: 流程讀起來通順後就匯出。

source: Exporting
zh_hans: 导出
zh_hk: 匯出

source: Figure 1: Interface layout
zh_hans: 图 1：界面布局
zh_hk: 圖 1：介面佈局

source: Figure 2: Right-click a block to edit it
zh_hans: 图 2：右键点击区块即可修改
zh_hk: 圖 2：右鍵點擊區塊即可修改

source: Figure 3: Exported screens in flow order
zh_hans: 图 3：按流程顺序导出的屏幕
zh_hk: 圖 3：按流程順序匯出的畫面

source: File
zh_hans: 文件
zh_hk: 檔案

source: Files are named by screen order and slug, so the folder reads in flow order.
zh_hans: 文件按屏幕顺序与标识命名，因此文件夹本身就是可读的流程顺序。
zh_hk: 檔案按畫面順序與識別命名，因此資料夾本身就是可讀的流程順序。

source: Hi-Fi
zh_hans: 高保真
zh_hk: 高保真

source: HTML Source
zh_hans: HTML 源码
zh_hk: HTML 原始碼

source: In Project
zh_hans: 项目内
zh_hk: 專案內

source: Interface
zh_hans: 界面
zh_hk: 介面

source: links
zh_hans: 个跳转
zh_hk: 個跳轉

source: Links are declared in the HTML and shown as a count in the toolbar.
zh_hans: 跳转在 HTML 中声明，工具栏会显示当前屏的跳转数量。
zh_hk: 跳轉在 HTML 中宣告，工具列會顯示目前畫面的跳轉數量。

source: Links that point at a deleted screen are reported by the lint tool.
zh_hans: 指向已删除屏幕的跳转会由校验工具报出。
zh_hk: 指向已刪除畫面的跳轉會由驗證工具報出。

source: Mode
zh_hans: 模式
zh_hk: 模式

source: No project open means the tools are unavailable.
zh_hans: 没有打开项目时，这些工具不可用。
zh_hk: 沒有開啟專案時，這些工具無法使用。

source: No screens yet
zh_hans: 还没有屏幕
zh_hk: 還沒有畫面

source: Notes
zh_hans: 注意事项
zh_hk: 注意事項

source: OK
zh_hans: 好
zh_hk: 好

source: Open a project to enable project-local storage.
zh_hans: 打开一个项目以启用项目内存储。
zh_hk: 開啟一個專案以啟用專案內儲存。

source: Open the Prototypes tab in the sidebar.
zh_hans: 打开侧边栏的「原型项目」标签页。
zh_hk: 開啟側邊欄的「原型專案」標籤頁。

source: Operation Failed
zh_hans: 操作失败
zh_hk: 操作失敗

source: Overview
zh_hans: 概述
zh_hk: 概述

source: Please modify this prototype element. I will add the requested change below.
zh_hans: 请修改这个原型元素，我会在下方补充具体要求。
zh_hk: 請修改這個原型元素，我會在下方補充具體要求。

source: Preview
zh_hans: 预览
zh_hk: 預覽

source: Preview and Iterate
zh_hans: 预览与迭代
zh_hk: 預覽與迭代

source: Preview: shows the selected screen on the device canvas, scaled to fit.
zh_hans: 预览：在设备画板上显示当前屏幕，自动缩放以适应窗口。
zh_hk: 預覽：在裝置畫板上顯示目前畫面，自動縮放以適應視窗。

source: Project
zh_hans: 项目
zh_hk: 專案

# Prompt.Suggestion.Create
source: Design a prototype
zh_hans: 设计一个产品原型
zh_hk: 設計一個產品原型

source: Prototype Designer
zh_hans: 原型设计器
zh_hk: 原型設計器

source: Prototype Element Reference (v1)
zh_hans: 原型元素引用（v1）
zh_hk: 原型元素引用（v1）

source: Prototypes
zh_hans: 原型项目
zh_hk: 原型專案

source: Prototypes are stored in the current project's .lumi directory.
zh_hans: 原型存储在当前项目的 .lumi 目录中。
zh_hk: 原型儲存在目前專案的 .lumi 目錄中。

source: Prototypes are stored with the current project and available only to it.
zh_hans: 原型随当前项目存储，仅该项目可用。
zh_hk: 原型隨目前專案儲存，僅該專案可用。

source: Prototypes live in the project's .lumi/prototype directory.
zh_hans: 原型存放在项目的 .lumi/prototype 目录。
zh_hk: 原型存放在專案的 .lumi/prototype 目錄。

source: Prototypes tab in the sidebar
zh_hans: 侧边栏的「原型项目」标签页
zh_hk: 側邊欄的「原型專案」標籤頁

source: Refresh
zh_hans: 刷新
zh_hk: 重新載入

source: Render every screen as a PNG at the device's exact pixel size.
zh_hans: 每一屏都按设备的精确像素尺寸渲染为 PNG。
zh_hk: 每個畫面都按裝置的精確像素尺寸算繪為 PNG。

source: Review the rendered screen in the preview.
zh_hans: 在预览中查看渲染结果。
zh_hk: 在預覽中查看算繪結果。

source: Review the rendered screens in the preview.
zh_hans: 在预览中查看渲染结果。
zh_hk: 在預覽中查看算繪結果。

source: Right-click a block to edit it
zh_hans: 右键点击区块即可修改
zh_hk: 右鍵點擊區塊即可修改

source: Right-click a region to draft an edit request for that block.
zh_hans: 右键某个区块，即可针对它起草修改请求。
zh_hk: 右鍵某個區塊，即可針對它起草修改請求。

source: Screen
zh_hans: 屏幕
zh_hk: 畫面

source: Screen Title
zh_hans: 屏幕标题
zh_hk: 畫面標題

source: screens
zh_hans: 个屏幕
zh_hk: 個畫面

source: Screens are HTML documents. Scripts and remote resources are rejected; ask the Agent to import images into the project instead.
zh_hans: 屏幕是 HTML 文档。脚本与远程资源会被拒绝，图片请让 Agent 导入到项目中。
zh_hk: 畫面是 HTML 文件。指令碼與遠端資源會被拒絕，圖片請讓 Agent 匯入到專案中。

source: Screens link to each other so you can read the flow, not just single pictures.
zh_hans: 屏幕之间互相跳转，你看到的是流程，而不只是单张图。
zh_hk: 畫面之間互相跳轉，你看到的是流程，而不只是單張圖。

source: Select a screen from the left, or ask the Agent to create a prototype.
zh_hans: 从左侧选择一个屏幕，或让 Agent 创建一个原型项目。
zh_hk: 從左側選擇一個畫面，或讓 Agent 建立一個原型專案。

source: Selector
zh_hans: 定位
zh_hk: 定位

source: Sidebar
zh_hans: 侧边栏
zh_hk: 側邊欄

source: Sidebar: prototype projects and their screens for the current project.
zh_hans: 侧边栏：当前项目下的原型项目及其屏幕。
zh_hk: 側邊欄：目前專案下的原型專案及其畫面。

source: Sketch product prototypes as connected HTML screens.
zh_hans: 用互相连接的 HTML 屏幕勾勒产品原型。
zh_hk: 用互相連結的 HTML 畫面勾勒產品原型。

source: Small edits are applied as precise text replacements, so unrelated parts stay untouched.
zh_hans: 小幅修改以精确文本替换的方式应用，无关部分不受影响。
zh_hk: 小幅修改以精確文字替換的方式套用，無關部分不受影響。

source: Start
zh_hans: 起始
zh_hk: 起始

source: State changes in the conversation, such as copy, layout, or color.
zh_hans: 在对话里说明改动，例如文案、布局或配色。
zh_hk: 在對話裡說明改動，例如文案、佈局或配色。

source: Storage
zh_hans: 存储
zh_hk: 儲存

source: The Agent inspects each render and refines the layout in the conversation.
zh_hans: Agent 会查看每次渲染结果，在对话中迭代布局。
zh_hk: Agent 會查看每次算繪結果，在對話中迭代佈局。

source: The Agent picks a device canvas and a visual style, then writes each screen.
zh_hans: Agent 会选定设备画板与视觉风格，然后逐屏写出内容。
zh_hk: Agent 會選定裝置畫板與視覺風格，然後逐個畫面寫出內容。

source: The Agent picks a device canvas, then writes each screen's HTML.
zh_hans: Agent 会选定设备画板，然后逐屏写出 HTML。
zh_hk: Agent 會選定裝置畫板，然後逐個畫面寫出 HTML。

source: The selected element is too large to add to the conversation.
zh_hans: 所选元素过大，无法添加到对话。
zh_hk: 所選元素過大，無法加入對話。

source: This manual covers the interface and basic operations of the Prototype Designer: creating, editing, linking, and exporting product prototype screens.
zh_hans: 本手册介绍原型设计器的界面与基本操作：创建、编辑、连接和导出产品原型屏幕。
zh_hk: 本手冊介紹原型設計器的介面與基本操作：建立、編輯、連接和匯出產品原型畫面。

source: Toolbar
zh_hans: 工具栏
zh_hk: 工具列

source: Toolbar: prototype style, device canvas, link count, Preview / HTML Source switch, Refresh, and Export.
zh_hans: 工具栏：原型风格、设备画板、跳转数量、预览 / HTML 源码切换、刷新与导出。
zh_hk: 工具列：原型風格、裝置畫板、跳轉數量、預覽 / HTML 原始碼切換、重新載入與匯出。

source: User Manual
zh_hans: 使用手册
zh_hk: 使用手冊

source: Where to Find It
zh_hans: 在哪里找到它
zh_hk: 在哪裡找到它

source: Wireframe
zh_hans: 线框图
zh_hk: 線框圖

source: Sent to Conversation
zh_hans: 已发送到对话

source: Conversation input is unavailable.
zh_hans: 对话输入不可用。

source: Selection changed; please try again.
zh_hans: 选择已变更，请重试。
